sroggerini/SCU_FW_Develop/Src/stm32f4xx_periph_init.c
 /**
* @file        stm32f4xx_periph_init.c
*
* @brief       Peripheral initialization for stm32f4xx  - Implementation -
*
* @riskClass   C 
*
* @moduleID  
*
* @vcsInfo
*     $Id: stm32f4xx_periph_init.c 
*
*     $Revision:
*
*     $Date: 
*
*
* @copyright
*       Copyright (C) 2020 SCAME S.p.A. All rights reserved.
*       This file is copyrighted and the property of Aesys S.p.A.. It contains confidential and proprietary
*       information. Any copies of this file (in whole or in part) made by any method must also include a copy of this
*       legend.
*       Developed by:  SCAME S.p.A.
***********************************************************************************************************************/

/************************************************************
 * Include
 ************************************************************/

#include "main.h"
#include "stm32f4xx_periph_init.h"

/*
***********************************SCAME**************************************
**                                                                          **
**           LOCAL MACROS, TYPEDEF, STRUCTURE, ENUM                         **
**                                                                          **
******************************************************************************
*/

/*
***********************************SCAME**************************************
**                                                                          **
**                            Local Const                                   **
**                                                                          **
****************************************************************************** 
*/ 

/*
***********************************SCAME**************************************
**                                                                          **
**                            Local Variables                               **
**                                                                          **
****************************************************************************** 
*/ 

ADC_HandleTypeDef hadc1;

ADC_HandleTypeDef hadc2;

ADC_HandleTypeDef hadc3;

DMA_HandleTypeDef hdma_adc1;

DMA_HandleTypeDef hdma_adc2;

DMA_HandleTypeDef hdma_adc3;

DAC_HandleTypeDef hdac;

I2C_HandleTypeDef hi2c1;

RTC_HandleTypeDef hrtc;

SPI_HandleTypeDef hspi1;

TIM_HandleTypeDef htim3;

UART_HandleTypeDef huart3;
UART_HandleTypeDef huart6;

TIM_HandleTypeDef htim1;
UART_HandleTypeDef huart1;
UART_HandleTypeDef huart2;
UART_HandleTypeDef huart5;
IWDG_HandleTypeDef hiwdg;
I2C_HandleTypeDef hi2c3;

static TIM_HandleTypeDef  htim6;

DMA_HandleTypeDef hdma_uart5_tx;
DMA_HandleTypeDef hdma_uart5_rx;
DMA_HandleTypeDef hdma_usart1_rx;
DMA_HandleTypeDef hdma_usart1_tx;
DMA_HandleTypeDef hdma_usart2_rx;
DMA_HandleTypeDef hdma_usart2_tx;
DMA_HandleTypeDef hdma_usart3_tx;
DMA_HandleTypeDef hdma_usart3_rx;
DMA_HandleTypeDef hdma_usart6_rx;
DMA_HandleTypeDef hdma_usart6_tx;

/*
***********************************SCAME**************************************
**                                                                          **
**                            Global Variables                              **
**                                                                          **
****************************************************************************** 
*/ 


/*
*********************************** SCAME ************************************
**                                                                          **
**                            External Variables                            **
**                                                                          **
******************************************************************************
*/

extern uint32_t calpValue, calmValue;

/*
***********************************SCAME**************************************
**                                                                          **
**                            Internal Function prototype                   **
**                                                                          **
******************************************************************************
*/
void SystemClock_Config(void);
void MX_ADC1_Init(void);
void MX_I2C1_Init(void);
void MX_SPI1_Init(void);
void MX_UART5_Init(void);
void MX_USART3_UART_Init(void);
void MX_DMA_Init(void);
void MX_USART6_UART_Init(void);
void MX_GPIO_Init(void);
void MX_RTC_Init(void);
void MX_TIM1_Init(void);
void MX_USART2_UART_Init(void);
void MX_USART1_UART_Init(void);
void MX_I2C3_Init(void);
void StopMode_Measure(void);
void TIM6_Config(void);
 
/*
***********************************SCAME**************************************
**                                                                          **
**                            Function Definition                           **
**                                                                          **
******************************************************************************
*/

 
/**
  * @brief  The application entry point.
  * @retval int
  */  
 

/*********************************************************************************************************************/
/*************************  Peripheral initialization for STM32F4xx device ********************************************/
/*********************************************************************************************************************/

/**
  * @brief Internal watch dog Init
  * @param None
  * @retval None
  */

#ifdef ACTIVE_IWDG

void MX_IWDG_Init(void)
{

  hiwdg.Instance = IWDG;
  hiwdg.Init.Prescaler = IWDG_PRESCALER_64;
  hiwdg.Init.Reload = 4095;
  if (HAL_IWDG_Init(&hiwdg) != HAL_OK)
  {
    _Error_Handler(__FILE__, __LINE__);
  }
  __HAL_DBGMCU_FREEZE_IWDG();
}

#endif

/**
  * @brief ADC1 Initialization Function
  * @param None
  * @retval None
  */
void MX_ADC1_Init(void)
{

  /* USER CODE BEGIN ADC1_Init 0 */

