sroggerini/SCU_FW_Develop/Src/stm32f4xx_periph_init.c
  /* Configure PWRDWN1L output level @HIGH level*/
  HAL_GPIO_WritePin(GPIOD, PWRDWN1L_Pin, GPIO_PIN_SET);
  
  /* Enable external oscillator @50MHz */
  HAL_GPIO_WritePin(OSC_50MHz_ON_GPIO_Port, OSC_50MHz_ON_Pin, GPIO_PIN_SET);
  
  /* Configure WIFI_EN pin @LOW level --> wifi module resetted */  
  HAL_GPIO_WritePin(GPIOD, WIFI_EN_Pin, GPIO_PIN_RESET);

  /*Configure GPIO pin Output Level */
  HAL_GPIO_WritePin(SPI1_NSS_GPIO_Port, SPI1_NSS_Pin, GPIO_PIN_SET);

  /*Configure GPIO pins : RACT_STATUS_Pin RCDM_Pin */
  GPIO_InitStruct.Pin = RACT_STATUS_Pin|RCDM_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(GPIOE, &GPIO_InitStruct);

  /*Configure GPIO pins : LCD_D0_Pin LCD_D1_Pin LCD_D2_Pin LCD_D3_Pin
                           SPI1_NSS2_Pin LCD_RS_Pin LCD_CS_Pin */
  GPIO_InitStruct.Pin = LCD_D0_Pin|LCD_D1_Pin|LCD_D2_Pin|LCD_D3_Pin
                          |SPI1_NSS2_Pin|LCD_RS_Pin|LCD_CS_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(GPIOE, &GPIO_InitStruct);

  /*Configure GPIO pin : RFID_PWR_Pin */
  /* NOTE: The initialization of RFID_PWR_Pin must be removed from here, because powering on the RFID at this point, could cause a stuck of 5V
           when the VIN is falling for power down.                                                                                                    */  
  // INTENTIONALLY REMOVED --> GPIO_InitStruct.Pin = RFID_PWR_Pin;
  // INTENTIONALLY REMOVED --> GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  // INTENTIONALLY REMOVED --> GPIO_InitStruct.Pull = GPIO_NOPULL;
  // INTENTIONALLY REMOVED --> GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  // INTENTIONALLY REMOVED --> HAL_GPIO_Init(RFID_PWR_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pins : REM_ACTOFF_Pin SBC_PWR_Pin REM_ACTON_Pin */
  GPIO_InitStruct.Pin = REM_ACTOFF_Pin|SBC_PWR_Pin|REM_ACTON_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

  /*Configure GPIO pins : LCD_RW_Pin */
  GPIO_InitStruct.Pin = LCD_RW_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = GPIO_PULLUP;
  HAL_GPIO_Init(GPIOE, &GPIO_InitStruct);
  
  /*Configure GPIO pin : INT_INx_Pin */
  GPIO_InitStruct.Pin = INT_INx_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_IT_FALLING;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(INT_INx_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pins : IN2_Pin RFID_DTC_Pin */
  GPIO_InitStruct.Pin = IN2_Pin|RFID_DTC_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = GPIO_PULLUP;
  HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

  /*Configure GPIO pins : OUTBL1_P_Pin CNTCT_Pin PWR_DWN1L_Pin WIFI_EN_Pin
                           OUTBL1_M_Pin SGCBOB_Pin  OSC_50MHz_ON_Pin */
  GPIO_InitStruct.Pin = OUTBL1_P_Pin|CNTCT_Pin|PWRDWN1L_Pin|WIFI_EN_Pin
                          |OUTBL1_M_Pin|SGCBOB_Pin|OSC_50MHz_ON_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(GPIOD, &GPIO_InitStruct);
    
  /*Configure GPIO pins : DIODO_ADC_Pin */
  GPIO_InitStruct.Pin = DIODO_ADC_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(GPIOD, &GPIO_InitStruct);

  /*Configure GPIO pins : IN6_Pin - SW_PROG_Pin - IN5_Pin */
  GPIO_InitStruct.Pin = IN6_Pin|SW_PROG_Pin|IN5_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = GPIO_PULLUP;
  HAL_GPIO_Init(GPIOD, &GPIO_InitStruct);

  /*Configure GPIO pin : VAC230_DET_INT_Pin */
  GPIO_InitStruct.Pin = VAC230_DET_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = GPIO_PULLUP;
  HAL_GPIO_Init(VAC230_DET_GPIO_Port, &GPIO_InitStruct);
  
  /*Configure GPIO pin : UART1_DE_Pin */
  GPIO_InitStruct.Pin = UART1_DE_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_PULLUP;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(UART1_DE_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pin : SPI1_NSS_Pin */
  GPIO_InitStruct.Pin = SPI1_NSS_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_PULLUP;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
  HAL_GPIO_Init(SPI1_NSS_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pin : UART_DE_Pin */
  GPIO_InitStruct.Pin = UART2_DE_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_PULLUP;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(UART2_DE_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pin : SBC_ONN_Pin */
  GPIO_InitStruct.Pin = SBC_CONN_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = GPIO_PULLDOWN;
  HAL_GPIO_Init(SBC_CONN_GPIO_Port, &GPIO_InitStruct);
  
  /* SINAPSI is active LOW: default is "1" --> NO sinapsi */
  GPIO_InitStruct.Pin = SINAPSI_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(SINAPSI_GPIO_Port, &GPIO_InitStruct);

  /*CANTX  used as debug pin   */
  HAL_GPIO_WritePin(GPIO1_uP_GPIO_Port, GPIO1_uP_Pin, GPIO_PIN_SET);

#ifdef DEBUG_TRACE_PIN
  /*Configure GPIO pins : GPIO1_uP_Pin PD1 */
  GPIO_InitStruct.Pin = GPIO1_uP_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_PULLUP;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(GPIO1_uP_GPIO_Port, &GPIO_InitStruct);
  
  /*Configure GPIO pins : GPIO0_uP_Pin PA11 as input: used as handshake line for motor control between SCU's*/
  GPIO_InitStruct.Pin = GPIO0_uP_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_PULLUP;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(GPIO0_uP_GPIO_Port, &GPIO_InitStruct);
#endif

  /*********** WIFI /DBG  AREA *****************************************/

  /*Configure GPIO pin Output Level for DBG --> PC use */
  HAL_GPIO_WritePin(SPI1_NSS2_GPIO_Port, SPI1_NSS2_Pin, GPIO_PIN_RESET);
  /*Configure GPIO pins : BT_RST_Pin */
  GPIO_InitStruct.Pin = SPI1_NSS2_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  //GPIO_InitStruct.Pull = GPIO_PULLUP;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(SPI1_NSS2_GPIO_Port, &GPIO_InitStruct);

  
  
  /*** EXT Int on IRQ pin ****/
  HAL_NVIC_SetPriority(EXTI15_10_IRQn, 10, 10);
  HAL_NVIC_EnableIRQ(EXTI15_10_IRQn);

}


/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
